# Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», яка повинна знаходити 
# згадки про меню, спортзал, обслуговування(за кожне знайдене співпадіння нараховується 5% знижки на 
# наступне відвідування). Якщо фідбек перевищив 60 символів, відвідувачу надається додаткова знижка 
# 15% на наступне відвідування.

#Наступний текст можна скопіювати!
# Курорт "Морська зірка" приємно здивував! Меню різноманітне й смачне, особливо морепродукти, — все свіже та з багатим смаком. Спортзал сучасний, з новим обладнанням — тренуватись було комфортно, навіть для досвідчених спортсменів. Обслуговування на високому рівні: персонал привітний та уважний. Протягом усього відпочинку відчувається, що про гостей турбуються на всіх рівнях. Курорт "Морська зірка" — ідеальне місце для поєднання активного відпочинку та релаксації.

feedback = input('Enter your feedback: ')
feedback_tuple = feedback.split(' ')
feedback_words_tuple = ('меню', 'Меню', 'спортзал', 'Спортзал', 'Обслуговування', 'обслуговування' )
discount = 0
for i in feedback_words_tuple:
    if(i in feedback_tuple):
        print('Your discount + 5%')
        discount +=5
if(feedback_tuple.__len__() > 60):
        discount += 15
        print('Your feedback more than 60 words. Your get  + 15''% ''discount')
print(f'Your total discount = {discount}%')